Ran Plan for project: `vntechies-gitops` dir: `terraform/ap-southeast-1` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_subnets.eks_vpc_subnets: Reading...
module.eks.data.aws_caller_identity.current: Read complete after 1s [id=010352592457]
data.aws_subnets.eks_vpc_subnets: Read complete after 0s [id=ap-southeast-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.25"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.25"
      + version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
+ resource "aws_eks_addon" "this" {
      + addon_name               = "aws-ebs-csi-driver"
      + addon_version            = (known after apply)
      + arn                      = (known after apply)
      + cluster_name             = "thodung-vntechies-eks-demo-eks"
      + configuration_values     = (known after apply)
      + created_at               = (known after apply)
      + id                       = (known after apply)
      + modified_at              = (known after apply)
      + resolve_conflicts        = "OVERWRITE"
      + service_account_role_arn = (known after apply)
      + tags_all                 = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
    }

  # module.eks.aws_eks_addon.this["cni"] will be created
+ resource "aws_eks_addon" "this" {
      + addon_name               = "vpc-cni"
      + addon_version            = (known after apply)
      + arn                      = (known after apply)
      + cluster_name             = "thodung-vntechies-eks-demo-eks"
      + configuration_values     = (known after apply)
      + created_at               = (known after apply)
      + id                       = (known after apply)
      + modified_at              = (known after apply)
      + resolve_conflicts        = "OVERWRITE"
      + service_account_role_arn = (known after apply)
      + tags_all                 = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
    }

  # module.eks.aws_eks_cluster.eks will be created
+ resource "aws_eks_cluster" "eks" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "thodung-vntechies-eks-demo-eks"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags_all              = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + version               = "1.25"

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-01183ba54fce29ae7",
              + "subnet-0b1743b318f3693ee",
              + "subnet-0cb7fc68240103b1b",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.node["workers-1-23"] will be created
+ resource "aws_eks_node_group" "node" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "thodung-vntechies-eks-demo-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3a.medium",
        ]
      + node_group_name        = "workers-1-23"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-01183ba54fce29ae7",
          + "subnet-0b1743b318f3693ee",
          + "subnet-0cb7fc68240103b1b",
        ]
      + tags_all               = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + version                = "1.25"

      + scaling_config {
          + desired_size = 3
          + max_size     = 5
          + min_size     = 3
        }

      + update_config {
          + max_unavailable_percentage = 40
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.ebs_csi["aws-ebs-csi-driver"] will be created
+ resource "aws_iam_policy" "ebs_csi" {
      + arn         = (known after apply)
      + description = "Custom Manged Policy for IRSA for the Kubernetes service account ebscsi-controller-sa."
      + id          = (known after apply)
      + name        = "thodung-vntechies-demo-eks-ebs-csi"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateSnapshot",
                          + "ec2:AttachVolume",
                          + "ec2:DetachVolume",
                          + "ec2:ModifyVolume",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeSnapshots",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeVolumesModifications",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "ec2:CreateAction" = [
                                  + "CreateVolume",
                                  + "CreateSnapshot",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ec2:DeleteTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/kubernetes.io/created-for/pvc/name" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteSnapshot",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteSnapshot",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
    }

  # module.eks.aws_iam_role.cluster will be created
+ resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-cluster-thodung-vntechies-demo-eks"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.irsa["aws-ebs-csi-driver"] will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "AWS IAM Role for the Kubernetes service account ebscsi-controller-sa."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws-ebs-csi-driver"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.node will be created
+ resource "aws_iam_role" "node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-node-group-thodung-vntechies-demo-eks"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly will be created
+ resource "aws_iam_role_policy_attachment" "AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-node-group-thodung-vntechies-demo-eks"
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy will be created
+ resource "aws_iam_role_policy_attachment" "AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-cluster-thodung-vntechies-demo-eks"
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController will be created
+ resource "aws_iam_role_policy_attachment" "AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "eks-cluster-thodung-vntechies-demo-eks"
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy will be created
+ resource "aws_iam_role_policy_attachment" "AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-node-group-thodung-vntechies-demo-eks"
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy will be created
+ resource "aws_iam_role_policy_attachment" "AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-node-group-thodung-vntechies-demo-eks"
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonSSMManagedInstanceCore will be created
+ resource "aws_iam_role_policy_attachment" "AmazonSSMManagedInstanceCore" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "eks-node-group-thodung-vntechies-demo-eks"
    }

  # module.eks.aws_iam_role_policy_attachment.irsa_ebs_csi_policy["aws-ebs-csi-driver"] will be created
+ resource "aws_iam_role_policy_attachment" "irsa_ebs_csi_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "aws-ebs-csi-driver"
    }

  # module.eks.kubernetes_config_map_v1_data.aws_auth[0] will be created
+ resource "kubernetes_config_map_v1_data" "aws_auth" {
      + data          = (known after apply)
      + field_manager = "Terraform"
      + force         = true
      + id            = (known after apply)

      + metadata {
          + name      = "aws-auth"
          + namespace = "kube-system"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ aws_iam_openid_connect_provider_arn = (known after apply)
+ eks_cluster_arn                     = (known after apply)
+ eks_cluster_endpoint                = (known after apply)
+ eks_cluster_id                      = (known after apply)
+ eks_cluster_name                    = "thodung-vntechies-eks-demo-eks"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p vntechies-gitops`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.hungran.cloud:4141/lock?id=vntechies%252F013-demo-gitops%252Fterraform%252Fap-southeast-1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p vntechies-gitops`
</details>
Plan: 17 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`